**Free

Dcl-S UserName Char(20);
Dcl-S i Int(3);

UserName = 'Mohammed Yusuf';

Dsply UserName;

for i = 1 to 10;
    Dsply i;
endfor;

*Inlr = *On;

Return;